package G1_클래스_알고리즘_레벨1;

import java.util.Scanner;
/*
 * # 숫자이동 : 클래스 + 변수
 * 1. 숫자2는 캐릭터이다.
 * 2. 숫자1을 입력하면, 캐릭터가 왼쪽으로
 * 	    숫자2를 입력하면, 캐릭터가 오른쪽으로 이동한다.
 * 3. 숫자 1은 벽이다. 벽을 만나면 이동할 수 없다.
 * 4. 단, 숫자3을 입력하면, 벽을 격파할 수 있다.
 * 5. 좌우 끝에 도달해도 계속 반대편으로 이동이 가능하다.
 * 6. 필요한변수는 추가해도된다. 
 * 
 * 예) 
 *  0 0 0 0 0 0 0 2 
 *  왼쪽(1) 오른쪽(2) : 2
 *  
 *  2 0 0 0 0 0 0 0 
 */


class GameMove{
	int[] game = {0, 0, 1, 0, 2, 0, 0, 1, 0};
}


public class 클래스1_알고리즘_숫자이동 {
	public static void main(String[] args) {
		


	}
}
