<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="EUC-KR"%>
<%--
	[가까운수] 
		1 에서 200 사이의 숫자중 다음 조건에 전부 맞는 숫자를 출력.
	   	[조건1] 6의 배수를출력
	    [조건2] 100에 가장가까운 수를 출력 
	
		정답 : 102			
--%>  		
<%--
	[시험점수]
	
	   	철수는 두번의 시험에서 각각 80점과 72점을 받았다.
	    세 번째 시험에서 최소 몇 점이상을 받아야 	        
	    세번의 시험성정의 평균이 82점이상이 될수 있을까?
--%>       
<%--
	[랜덤점수통계]
	  
	   1. 10회 반복을 한다.
	   2. 1~100 사이의 랜덤 숫자를 저장한다.(학생의 성적)
	   3. 성적이 60점 이상이면 합격생이다.
	   ---------------------------------------
  	   [1] 전교생(10명)의 총점과 평균을 출력한다.
   	   [2] 합격자 수를 출력한다.
   	   [3] 1등 학생의 번호와 성적을 출력한다.
--%>
<%--
	 [369박수]
	 
		 1. 1~50까지 반복을 한다.
		 2. 그 안에서 해당 숫자의 369게임의 결과를 출력한다.		  
		 3. 각각의 숫자에 3이나 6이나 9가 두개 면 "짝짝"
		 4. 각각의 숫자에 3이나 6이나 9가 한개 면 "짝"
		 5. 3이나 6이나 9가 없으면 그냥 숫자출력 
		  
		  예) 1 2 짝 4 5 짝 7 8 짝 10 11 12 짝 ...
--%> 