<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="EUC-KR"%>
<%--
	   	array = {10,20,30,40,50};
	  
		[문제1] 4의 배수만 출력한다.
		[예] 20 40
		
		[문제2] 4의 배수의 합을 출력한다.
		[예] 60
		
		[문제3] 4의 배수의 개수를 출력한다.
		[예] 2
--%> 

<%--
	   	[문제1] array 배열에 1~100점 사이의 랜덤 정수를 5개 저장하고 출력
		 예)    87, 11, 92, 14, 47
		
		[문제2] 전교생의 총점과 평균 출력
		 예)    총점(251) 평균(50.2)
		
		[문제3] 성적이 60점 이상이면 합격. 합격생 수 출력
		 예)   2명
--%> 
<%--
	 a = { 1,2,3,4,5 };
	  
	 [문제] a 배열의 값을 b 배열에 하나씩 저장하는데 순서를 거꾸로 저장 
	 [예]   b = {5,4,3,2,1};
--%> 
<%--
	  [문제] b 배열을 아래와같이 사각형모양으로출력한다.
	  [힌트] 3칸마다 줄을 바꿔준다.

	   1 2 3
	   4 5 6
	   7 8 9  
--%> 
<%--
	 [문제1] 
	  		array1 배열의 값들을 앞으로 한칸씩 당기고 맨뒤에 a의  값을 저장한다.
	  		[예] array1 = {20,30,40,50,90};
	  
	 [문제2] array2 의 배열을 뒤로 하나씩 밀어낸후 맨 앞에 b의 값을 저장한다.
	  		[예] array2 = {60,10,20,30,40};
--%> 